{
    "title": "Japanese Cheesecake",
    "quantity": "An 8 inch cake",
    "preptime": "20 minutes",
    "totaltime": "1 hour",
    "notes": "",
    "ingredients": [
        "8 oz {cream cheese}",
        "1/2 cup whole {milk}",
        "1/4 cup {butter} at room temperature",
        "1/2 cup granulated {sugar}, divided",
        "1 tablespoon {lemon juice}",
        "1/4 cup all-purpose {flour}",
        "2 tablespoons {cornstarch}",
        "5 large {eggs}, yolks and white separated",
        "1/4 teaspoon {cream of tartar}"
    ],
    "steps": [
        "Line the outside of an 8 inch springform pan with foil, to seal it from water.",
        "Fill a large baking pan half way with water and place it in the oven.",
        "Preheat the oven to 315 F",
        "In a large bowl, mix together the cream cheese and milk at low speed until creamy and smooth",
        "Add the butter, 1/4 cup of sugar, and lemon juice and beat for another minute.",
        "Add the flour and corn starch and beat for another minute.",
        "Add the egg yolks and beat for one last minute.",
        "In a separate bowl, beat the egg whites on low speed until foamy.",
        "Add the cream of tartar, and increase the mixer to medium-high speed.",
        "When the whites start to thicken, gradually add the remaining 1/4 cup sugar.",
        "Beat until the egg whites have reached soft peaks, about 3 minutes.",
        "In three batches, gently fold the egg whites into the batter until just incorporated.",
        "Pour the batter into the prepared springform pan and smooth the top with a spatula.",
        "Hold the sides of the pan and carefully drop it a short distance onto the counter to remove any large air bubbles.",
        "Place the springform pan into the water bath and bake for 60-70 minutes, until the top is golden and a toothpick inserted comes out clean.",
        "Allow to cool in the oven with the door open for an hour.",
        "Remove from pan and refrigerate for around 4 hours until completely chilled.",
        "Serve with fruit."

    ],
    "source": "http://runawayrice.com/desserts/cotton-cheesecakejapanese-cheesecake/",
    "tags": ["cake", "cheesecake"]
}
