{
    "title": "Pain de Mie",
    "quantity": "1 loaf",
    "preptime": "30 minutes",
    "totaltime": "5 hours",
    "notes": "This loaf works great with vegan butter, and is the perfect size for my pain de mie pan.",
    "ingredients": [
        "1 packet active dry {yeast}",
        "3/4 cup warm water, divided",
        "1 tsp granulated {sugar}",
        "3 cups all purpose {flour}",
        "2 tsp coarse sea {salt}",
        "2 tbsp unsalted {butter}"
    ],
    "steps": [
        "Stir together the yeast, 1/4 cup water, and sugar in a small bowl and set aside to proof.",
        "Combine the flour and salt in a large bowl and cut in the butter using a pastry blender or rubbing with your fingers/",
        "Add the yeast mixture and remaining water to the flour mixture with your hand or a rubber spatula, until a stiff dough forms.",
        "Knead for about 10 minutes, until the dough is smooth.",
        "Place the dough in a large bowl greased with butter, and turn the dough so that it is coated in butter.",
        "Cover the bowl and leave to rise in a warm place for 1 1/2 hours, until it doubles in size.",
        "Punch down the dough, and allow it to rest for 3-4 minutes.",
        "Knead the dough for another 3-4 minutes, then put it back in the bowl and allow to prove a second time, for 45 minutes to an hour.",
        "Punch down the dough again and let it rest for 3-4 minutes, then knead again for a few minutes.",
        "Shape the dough and place in the buttered pain de mie pan, and allow to prove for another 45 minutes to an hour, until it has about doubled.",
        "Prepheat the oven to 400 degrees F.",
        "Put the bread in the oven and immediately lower the temperature to 375 degrees.",
        "Bake for 30 minutes, and then turn the ban on its side and bake for another 5 minutes, and again for 5 minutes on the other side.",
        "Remove the lid from the pan and bake for until 12-15 minutes, until the bread makes a hollow sound when you knock on the bottom.",
        "Remove from pan and cool on a wire rack."
    ],
    "source": "Beard on Bread",
    "tags": ["bread", "vegan"]
}
